# За лятната ваканция в спикъка със задължителна литература на Жоро има определен брой книги, но Жоро предпочита да играе с приятели навън. Вашата задача е да помогнете на Жоро да изчисли колко часа на ден трябва да отделя, за да прочете необходимата литература, но и да прекарва максимално време навън.

# Вход
# От конзолата се четат 3 реда:
# Брой страници в текущата книга – цяло число;
# Страници, които може да прочита за 1 час – цяло число;
# Броя на дните, за които трябва да прочете книгата – цяло число;


# Изход
# Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.

number_pages_current = int(input())
pages_readed_for_1_hour = float(input())
number_days = int(input())

# изчисляваме общото време за четене на книгата
total_time_to_read_the_book = number_pages_current / pages_readed_for_1_hour

# получения резултат делим на броя дни, за да получим необходимите часове на ден
result_hours = total_time_to_read_the_book / number_days
print(result_hours)
